ASK_LIST = (
    "Каких поставщиков вы хотите отслеживать?\nНапишите все названия через запятую"
)


ASK_CHOOSING_ACTION = "Что вы хотите сделать?"
CHOOSING_ACTION = f"\n{"=" * 20}\n•Изменить поставщика\n•Удалить поставщика\n•Добавить поставщика\n•Начать заполнение заново"
CHOOSING_ACTION_LIST = [
    "Изменить поставщика",
    "Удалить поставщика",
    "Добавить поставщика",
    "Начать заполнение заново",
]

DONT_EXIST = "Введенный поставщик не найден\n"
ALREADY_EXIST = "Этот поставщик уже отслеживается\n-----\n"
EMPTY = "Невозможно внести изменения, список пуст\n----\n"

ASK_NEW_NAME = "Введите новое название для поставки"
ASK_NAME_FOR_CHANGE = "В каком поставщике вы хотите внести изменения?"
ASK_NAME_FOR_DELETE = "Какого поставщика вы хотите удалить?"

ITEM_DELETED = 'Поставщик "{item}" удален\n-----\n'

