ASK_QUANTITY = (
    'Сколько позиции \n"{position}" \nесть на данный момент?\nНапишите число в кг/л'
)

ASK_CHOOSING_ACTION = "Что вы хотите сделать?"
CHOOSING_ACTION = f"\n{"=" * 20}\n•Изменить количество\n•Начать заполнение заново"
CHOOSING_ACTION_LIST = ["Изменить количество", "Начать заполнение заново"]

DONT_EXIST = "Введенная позиция не найдена\n"
EMPTY = "Невозможно внести изменения\n----\n"

ASK_NEW_NAME = "Введите новое значение"
ASK_NAME_FOR_CHANGE = "В какой позиции вы хотите внести изменения?"
