ASK_LIST = 'Какие поставки приезжали?\nНапишите "готово", если поставок больше не было'

ASK_LIST_OTHER = "Какие еще поставки приезжали?"

ASK_CHOOSING_ACTION = "Что вы хотите сделать?"
CHOOSING_ACTION = f"\n{"=" * 20}\n•Изменить поставщика\n•Удалить поставщика\n•Добавить поставщика\n•Начать заполнение заново"
CHOOSING_ACTION_LIST = [
    "Изменить поставщика",
    "Удалить поставщика",
    "Добавить поставщика",
    "Начать заполнение заново",
]

DONT_EXIST = "Введенный поставщик не найден\n"
ALREADY_EXIST = "Этот поставщик уже добавлен\n-----\n"
EMPTY = "Невозможно внести изменения, список пуст\n----\n"

ASK_NEW_NAME = "Выберете другого поставщика"
ASK_NAME_FOR_CHANGE = "В каком поставщике вы хотите внести изменения?"
ASK_NAME_FOR_DELETE = "Какого поставщика вы хотите удалить?"

ITEM_DELETED = 'Поставщик "{item}" удален\n-----\n'
