ASK_QUANTITY = 'Сколько приехало позиции\n"{position}"?\nУкажите в кг/л/шт'

ASK_KEY_FOR_CHANGE = "В какой поставке вы хотите внести изменения?"


ASK_CHOOSING_ACTION = "Что вы хотите сделать?"
CHOOSING_ACTION = f"\n{"=" * 20}\n•Изменить количество\n•Начать заполнение заново"
CHOOSING_ACTION_LIST = ["Изменить количество", "Начать заполнение заново"]

DONT_EXIST = "Введенный товар/позиция не найден(а)\n-----\n"
EMPTY = "Невозможно внести изменения\n----\n"


ASK_NEW_NAME = "Введите новое значение в кг/л/шт"
ASK_NAME_FOR_CHANGE = "В какой позиции вы хотите внести изменения?"
ASK_NAME_FOR_DELETE = "Какой товар вы хотите удалить?"
